---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PhotometricWebLightDistribution Constructor
PhotometricWebLightDistribution Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | PhotometricWebLightDistribution(PhotometricWebLightDistribution) | Creates a copy of the given photometric web light distribution |
|  | PhotometricWebLightDistribution(String, Double) | Creates a photometric web light distribution object with the given filename and tilt. |

# See Also

PhotometricWebLightDistribution Class

PhotometricWebLightDistribution Members

Autodesk.Revit.DB.Lighting Namespace